In [109]:
import pandas as pd
import os
from ast import literal_eval

In [112]:
files = [x for x in os.listdir('./csv') if '0803' in x]
print(files)

['underlined_july_21_0803.csv', 'people_places08032022.csv']

In [113]:
underlined_df = pd.read_csv('./csv/underlined_july_21_0803.csv', encoding='latin-1')

# underlined_df.catnum = underlined_df.catnum.apply(literal_eval)
# underlined_df.catnum = underlined_df.catnum.str[0]

In [114]:
# underlined_df.catnum = underlined_df.catnum.str.replace('*', '',regex=False)
# underlined_df.catnum = underlined_df.catnum.fillna('0')
underlined_df.catnum = underlined_df.catnum.astype('int32')

In [116]:
underlined_df

,ï»¿label,catnum,underline,xml_id,person,object,person_ibid,place_ibid,Comments
0,Miscellanies.,1799,"bow, Amyand",EPF108491002v,#Mr._Amyand,NaN,NaN,NaN,East Indies not underlined
1,Miscellanies.,1800,"Arrows, Id.",EPF108491002v,NaN,NaN,#Mr._Amyand,NaN,from the same is not underlined. So the same p...
2,Miscellanies.,1801,"trumpet, Theobalds",EPF108491002v,#James_Theobalds_Esqr,NaN,NaN,NaN,Norway mentioned but not underlined
3,Miscellanies.,1802,shoe,EPF108491002v,NaN,NaN,NaN,NaN,Chinese womans
4,Miscellanies.,1803,girdle,EPF108491002v,NaN,NaN,NaN,NaN,Chinese womans
...,...,...,...,...,...,...,...,...,...
3910,Agate cups botles spoons &c.,298,Jasper haft,EPF108491329,NaN,NaN,NaN,NaN,NaN
3911,Agate cups botles spoons &c.,299,Another,EPF108491329,NaN,NaN,NaN,NaN,NaN
3912,Agate cups botles spoons &c.,300,Another,EPF108491329,NaN,NaN,NaN,NaN,NaN
3913,Agate cups botles spoons &c.,301,Jasper cup,EPF108491329,NaN,NaN,NaN,NaN,NaN
3914,Agate cups botles spoons &c.,302,"Amethyst, snuff box, Montmorency",EPF108491329,#Madam_Montmorency,NaN,NaN,NaN,NaN

In [118]:
underlined_df.columns

Index(['ï»¿label', 'catnum', 'underline', 'xml_id', 'person', 'object',
       'person_ibid', 'place_ibid', 'Comments'],
      dtype='object')

In [119]:

# ,errors='ignore')
underlined_df = underlined_df.rename(columns={'ï»¿label': 'label'})
underlined_df = underlined_df.sort_values(by=['label','catnum'])

In [120]:
underlined_df.to_csv('./csv/underlined_july_21_revised_090322.csv')

In [24]:
# Gather data from People_places (deb edit) and prepare for merge

In [121]:
people_path = './csv/people_places08032022.csv'
people_df = pd.read_csv(people_path, encoding='latin-1')

In [124]:
people_df.columns
people_df = people_df.rename(columns={'ï»¿label': 'label', 'Catnum': 'catnum'})

In [86]:
# people_df.catnum = people_df.catnum.apply(literal_eval)
# people_df.catnum = people_df.catnum.str[0]

In [125]:
people_df.head()

,label,catnum,Person,Person ID,Place,Place ID,Unnamed: 6
0,Miscellanies.,1799,['Mr. Amyand'],['#Mr._Amyand'],['East Indies'],['#East_Indies'],NaN
1,Miscellanies.,1801,['Mr. Theobalds'],['#James_Theobalds_Esqr'],['Norway'],['#Norway'],NaN
2,Miscellanies.,1806,['Mr. Roberts'],['#Mr_Roberts'],[],[],NaN
3,Miscellanies.,1807,['Mr. Mc. Cormick'],['#MrMC'],['Lisbon'],['#Lisbon'],NaN
4,Miscellanies.,1808,[],[],['Lisbone'],['#Lisbon'],NaN

In [126]:
# people_df.catnum = people_df.catnum.str.replace('*', '',regex=False)
# people_df.catnum = people_df.catnum.fillna('0')
people_df.catnum = people_df.catnum.astype('int32') 
people_df = people_df.sort_values(by=['label','catnum'])

In [127]:
people_df.to_csv('./csv/people_places_revised_090322.csv')

In [128]:
people_df

,label,catnum,Person,Person ID,Place,Place ID,Unnamed: 6
1361,Agate cups botles spoons &c.,8,['Mr. Marlow'],['#Mr._Marlow'],[],[],NaN
1362,Agate cups botles spoons &c.,11,['Mr. Marlow'],['#Mr._Marlow'],[],[],NaN
1363,Agate cups botles spoons &c.,13,['Mr. Marlow'],['#Mr._Marlow'],[],[],NaN
1364,Agate cups botles spoons &c.,19,['King Charles the first'],['#Charles_I'],[],[],NaN
1365,Agate cups botles spoons &c.,28,['Mrs. Hayes'],['#Mrs_Hayes'],[],[],NaN
...,...,...,...,...,...,...,...
1332,Pictures &c.,407,"['Mr. Ray', 'Faithorn']","['#John_Ray', '#William_Faithorne']",[],[],NaN
1333,Pictures &c.,468,['Mrs. A. Thornburgh'],['#Mrs._Thornburgh'],['antwerp'],['#Antwerp'],NaN
1334,Pictures &c.,469,['Mr. Halett'],['#Mr._Halett'],['Siam'],['#Siam'],NaN
1335,Pictures &c.,470,"['Mr. Thomas Briton', 'Woollaston']","['#Thomas_Britton', '#John_Wollaston']",['London'],['#London'],NaN
1336,Pictures &c.,471,"['Duke of Cumberland', 'Mr. Jackson']","['#Duke_of_Cumberland', '#Mr_Jackson']",[],[],NaN

In [ ]:
# Do merging of data

In [129]:
merged_df = pd.merge(underlined_df,people_df,on=['label', 'catnum'],how='outer')

In [130]:
merged_df.to_csv('./csv/merged_data.csv')

In [98]:
inner_merged_df = pd.merge(underlined_df,people_df,on=['label', 'catnum'])

In [99]:
inner_merged_df.to_csv('./csv/inner_merged_data.csv')

MERGING IN 3rd Spreadsheet (Collectors)

In [100]:
ea_df = pd.read_csv('csv/revised_EA_names.csv')

In [102]:
ea_df.columns

Index(['Unnamed: 0', 'Name', 'Catalogue', 'Catnum', 'Keyword', 'Place',
       'Dates', 'Profession'],
      dtype='object')

In [104]:
ea_df = ea_df.rename(columns={'Catalogue': 'label', 'Catnum': 'catnum'})

In [ ]:
ea_df.catnum = ea_df.catnum.astype('int32')

In [ ]:
final_merged_df = pd.merge(merged_df,ea_df,on=['label', 'catnum'],how='outer')